/*
 * @Descripttion: 用数组来处理 Fibonacci 数列问题
 * 1 1 2 3 5 8  13 21 34 55 89 144......
 * 费氏数列也称神秘数列，各个数字相互间维持着固定的关系与比率，其顺序的两个数字相加后，等于后面序列的数字
 * 费氏数列中前后两个数字相除的结果，大约会接近0.618或1.618
 * 费氏数列中间隔一个数字相邻的两个数字的比率是0.382
 * 黄金分割是由费氏数列演变而来的，所以费氏数列也称黄金数列，将 2 3 5 8 13 21 34 55 89......称作黄金数
 * @Author: may
 * @Date: 2020-05-23 11:26:12
 */
#include <iostream>
using namespace std;
int main()
{
    static int f[20] = {1,1};
    for (int i = 2; i < 20; i++)
    {
        f[i] = f[i-2] + f[i-1];
    }
    for (int i = 0; i < 20; i++)
    {
        if (i%5 == 0)
        {
            cout<<endl;
        }
        // 设置输出宽度为 12
        cout.width(12);
        cout<<f[i];
    }
    return 0;
}
